Version2/TestTool-Guinness/TestTool.Setup/Requests/Device Management/SetSystemDateAndTime/TC.DM.NVT.23_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
               xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetSystemDateAndTime>
      <tds:DateTimeType>Manual</tds:DateTimeType>
      <tds:DaylightSavings>true</tds:DaylightSavings>
      <tds:TimeZone>
        <tt:TZ>PST8PDT,M3.2.0/2,M11.1.0/2</tt:TZ>
      </tds:TimeZone>
      <tds:UTCDateTime>
        <tt:Time>
          <tt:Hour>18</tt:Hour>
          <tt:Minute>17</tt:Minute>
          <tt:Second>20</tt:Second>
        </tt:Time>
        <tt:Date>
          <tt:Year>2009</tt:Year>
          <tt:Month>11</tt:Month>
          <tt:Day>9</tt:Day>
        </tt:Date>
      </tds:UTCDateTime>
    </tds:SetSystemDateAndTime>
  </soap:Body>
</soap:Envelope>